#pragma once
#include <iostream>
#include <math.h>
using namespace std;

namespace exercise1
{
	class Time { //Декларация на клас Time
	private:
		int hour, minute, second; //Член-данни на класа (час, минута, секунда)
	public:
		void setTime(); //Декларация на член-функция за въвеждане на време
		void printTimeInFormat1(); //Декларация на член-функция за печатане във формат ЧЧ:ММ:СС
		void printTimeInFormat2(); //Декларация на член-функция за печатане във формат ЧЧ:ММ:СС AM/PM
		~Time() //Дефиниция на деструктор
		{
			/* cout или "character output" е команда за отпечатване на дефинирана комбинация от символи 
			   В случая изпечатваме "Destructing object Time", а символът '\n' се използва за добавяне на
			   "нов ред" в отпечатаната комбинация от символи */
			cout << "\nDestructing object Time!\n";
		}
	};

	/* В условитето е указано да използваме функция за задаване на начални стойности 
	   на час, минута и секунда. Бихме могли да използваме и "конструктор функцията Time()"
	   за тази цел, но бихме могли да създадем клас с празен конструктор (тъй като всеки клас, 
	   по подразбиране има "празен конструктор", който можем да предефинираме) 
	   и да използваме отделна функция за въвеждане на начални данни.*/
	void Time::setTime() //Дефиниция на член-функция
	{
		/* Проверка дали часът е със стойност между 0 и 24, 
		   минутата е със стойност между 0 и 60 
		   и секундата е със стойност между 0 и 60 */
		do
		{
			cout << "\n\nEnter three values for the hour, minute and second : \n"; 
			/* cin или "character input" е команда за въвеждане на комбинация от символи и
			   присвояването им към определена променлива. За всяка нова променлива добавяме >> 
			   преди присвояването и. */
			cin >> hour >> minute >> second;
		} while (!((hour >= 0 && hour <= 24) && (minute >= 0 && minute <= 60) && (second >= 0 && second <= 60)));
	}

	void Time::printTimeInFormat1() //Дефиниция на член-функция
	{
		cout << "\n\nThe time is \n";
		cout << hour << ":" << minute << ":" << second;
	}

	void Time::printTimeInFormat2() //Дефиниция на член-функция
	{
		cout << "\n\nThe time is \n";
		/* if калузата се използва за изпълняване на код, когато дадено условие е изпълнено. 
		   В случая когато hour >= 12 изпечатваме времето във формат включващ " PM" */
		if (hour >= 12)
		{
			cout << hour << ":" << minute << ":" << second << " PM";
		}
		/* else се използва заедно с if, и се изпълнява в случай, че условието в if не е изпълнено. */
		else 
		{
			cout << hour << ":" << minute << ":" << second << " AM";
		}
	}
}

